In [2]:
import numpy as np 
import pandas as pd

In [3]:
myindex = ['이순신', '김유신', '강감찬', '광해군', '연산군']
mycolumns = ['서울', '부산', '광주', '목포', '경주']
mylist = list( 10 * onedata for onedata in range(1, 26))
print(mylist)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

In [7]:
myframe = pd.DataFrame( np.reshape(mylist, (5, 5)), index=myindex, columns = mycolumns  )
myframe

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [8]:
# 1 행만 Series로 읽어 오기')
result = myframe.iloc[1]
type(result)
result

서울     60
부산     70
광주     80
목포     90
경주    100
Name: 김유신, dtype: int32

In [9]:
# 몇개의 행을 읽어 오기')
result = myframe.iloc[[1,3]]
type(result)
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
광해군  160  170  180  190  200

In [10]:
# 짝수행만 가져 오기')
result = myframe.iloc[0::2]
result

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [11]:
# 홀수행만 가져 오기 
# 이순신 행만 Series로 읽어 오기
result = myframe.loc['이순신']
type(result)
result

서울    10
부산    20
광주    30
목포    40
경주    50
Name: 이순신, dtype: int32

In [12]:
# 이순신 행만 DataFrame으로 읽어 오기
result = myframe.loc[['이순신']]
type(result)
result

     서울  부산  광주  목포  경주
이순신  10  20  30  40  50

In [13]:
# 강감찬와 이순신 행 읽어 오기
result = myframe.loc[['이순신', '강감찬']]
type(result)
result

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150

In [14]:
myframe.index

Index(['이순신', '김유신', '강감찬', '광해군', '연산군'], dtype='object')

In [15]:
mytarget = np.random.choice(myframe.index, 3)
mytarget

array(['김유신', '강감찬', '김유신'], dtype=object)

In [16]:
result = myframe.loc[ mytarget ]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
김유신   60   70   80   90  100

In [17]:
# 강감찬의  광주 실적 정보 가져 오기
result = myframe.loc[['강감찬'], ['광주']] # DataFrame
result

      광주
강감찬  130

In [18]:
# 연산군와 광해군의 광주/목포 정보 가져 오기
result = myframe.loc[['연산군', '강감찬'], ['광주', '목포']]
result

      광주   목포
연산군  230  240
강감찬  130  140

In [19]:
# 연속적인 데이터 가져 오기
result = myframe.loc['김유신':'광해군', '광주':'목포']
result

      광주   목포
김유신   80   90
강감찬  130  140
광해군  180  190

In [20]:
# 김유신~광해군까지  부산 실적 정보 가져 오기
result = myframe.loc['김유신':'광해군', ['부산']]
result

      부산
김유신   70
강감찬  120
광해군  170

In [21]:
# Boolean으로 데이터 처리하기
result = myframe.loc[[False, True, True, False, True]]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [22]:
# 부산 실적이 100이하인 항목들
result = myframe.loc[ myframe['부산'] <= 100 ]
result

     서울  부산  광주  목포   경주
이순신  10  20  30  40   50
김유신  60  70  80  90  100

In [23]:
# 목포 실적이 140인 항목들
result = myframe.loc[ myframe['목포'] == 140 ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150

In [24]:
cond1 = myframe['부산'] >= 70
cond2 = myframe['목포'] >= 140

type(cond1)

pandas.core.series.Series

In [25]:
cond1

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
Name: 부산, dtype: bool

In [26]:
cond2

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
Name: 목포, dtype: bool

In [27]:
df = pd.DataFrame([cond1, cond2])
df

      이순신    김유신   강감찬   광해군   연산군
부산  False   True  True  True  True
목포  False  False  True  True  True

In [28]:
df.all()

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
dtype: bool

In [29]:
df.any()

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
dtype: bool

In [30]:
result = myframe.loc[ df.all() ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [31]:
result = myframe.loc[ df.any() ]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [32]:
# 람다 함수의 사용
result = myframe.loc[ lambda df : df['광주'] >= 130  ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [33]:
# 이순신과 강감찬의 부산 실적을 30으로 변경하기
myframe.loc[['이순신', '강감찬'], ['부산']] = 30
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90  100
강감찬  110   30  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [34]:
## 김유신부터 광해군까지 경주 실적을 80으로 변경하시오.
myframe.loc['김유신':'광해군', ['경주']] = 80
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90   80
강감찬  110   30  130  140   80
광해군  160  170  180  190   80
연산군  210  220  230  240  250

In [35]:
# 연산군의 모든 실적을 50으로 변경하기
myframe.loc[['연산군'], :] = 50
myframe

      서울   부산   광주   목포  경주
이순신   10   30   30   40  50
김유신   60   70   80   90  80
강감찬  110   30  130  140  80
광해군  160  170  180  190  80
연산군   50   50   50   50  50

In [36]:
# 모든 사람의 광주 컬럼을 60으로 변경하기
myframe.loc[:, ['광주']] = 60
myframe

      서울   부산  광주   목포  경주
이순신   10   30  60   40  50
김유신   60   70  60   90  80
강감찬  110   30  60  140  80
광해군  160  170  60  190  80
연산군   50   50  60   50  50

In [37]:
# 경주 실적이 150이하인 데이터를 모두 0으로 변경하기
myframe.loc[myframe['경주'] <= 150 , ['경주', '광주']] = 0
myframe

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0

In [38]:
# 데이터 프레임 사용하기
myframe

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0